const task3 = 'ЗАДАНИЕ № 3';
console.log(task3);

const array = [
    'я в Сибирск,',
    ' в трактире.',
    ' с утра',
    'В ту же ночь',
    'Я остановился',
    ' для закупки',
    'что и было поручено Савельичу. ',
    ' приехал ',
    ' где должен был',
    ' нужных вещей, ',
    ' отправился по лавкам',
    ' пробыть сутки',
    ' Савельич'
];

const result = (array[3]) + (array[7]) + (array[0]) + (array[8]) + (array[11]) + (array[5]) + (array[9]) + (array[6]) + (array[4]) + (array[1]) + (array[12]) + (array[2]) + (array[10]);
console.log(result);